Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་སེང་གེའི་བློ་གྲོས་ཞེས་བྱ་བ་
en: “Maudgalyāyana, in the distant past, beyond unfathomable timespans of cyclic existence, there was a religious king known as Lion Intelligence.

source: ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ། གླིང་བཞི་པར་འདུས་པ་ཡོངས་སུ་སྐྱོང་བ་དང་ཞིང་དད་པ་དང་ལྡན་པ། བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པ།
en: He was a just ruler, who sustained the entire world of four continents. The king was faithful and learned in all treatises.

source: ཡོན་གནས་ལ་དགའ་བ། སྦྱིན་བདག་སྒྲ་ཐམས་ཅད་ལ་མཁས་པ་ཞིག་བྱུང་ངོ་། །
en: He delighted in being a patron and was learned in all expressions of benefaction.

source: དེ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་བསྡུས་ནས་ཁ་ཟས་རོ་བརྒྱ་པས་སྟོན་མོ་བྱས་སོ། །
en: The king would invite all the world’s mendicants and brahmins to partake of the most delicious feasts

source: ཡུལ་ཀ་ཤི་ཀའི་གོས་ཀྱིས་ཀྱང་མངོན་པར་བཀབ་བོ། །
en: and he would clothe them all in garments of Kāsika silk.

source: བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པས་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་ལ་ཡང་རྣམ་པར་ལྟའོ། །
en: An expert in all the treatises, he observed the thoughts of sentient beings,

source: ཤེས་རབ་ཀྱི་དབང་པོའི་སྟོབས་དང་། སྟོབས་མ་ཡིན་པ་ལ་ཡང་རྣམ་པར་འཇུག་གོ། །
en: and he was in pursuit of knowledge of the faculty of insight, both as a power and a non-power.

source: དེའི་དབང་པོ་ཤེས་པའི་སྟོབས་དང་། སྟོབས་མ་ཡིན་པ་རྣམ་པར་ཤེས་པར་བྱ་བའི་ཕྱིར། སེམས་ཅན་ཤེས་པ་ཁྱད་པར་ཅན་རྣམས་ལ་ཡང་མཆོད་པ་བྱེད་དོ། །
en: To obtain knowledge of the power and non-power of the faculty of insight, he made offerings to those in possession of special cognition.

source: དེ་ནས་རྒྱལ་པོ་སེང་གེའི་བློ་གྲོས་ཀྱིས་སྟོབས་དང་། སྟོབས་མ་ཡིན་པ་འདི་ཤེས་པར་བྱ་བའི་ཕྱིར། ལོ་ཁྲི་ཕྲག་བརྒྱད་དུ་ཉིན་མཚན་རྟག་པར་རྒྱུན་དུ་སྦྱིན་པ་བྱིན་ཞིང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དག་ལ་ཡང་ཡོངས་སུ་དྲིས་སོ། །
en: Thus, for this purpose, the king practiced generosity continuously throughout day and night for eighty thousand years while also making inquiries among mendicants and brahmins.

source: ཤེས་པ་སྨྲ་བ་དག་ལ་ཡང་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་ཉེ་བར་བརྟགས་སོ། །
en: In this way he investigated cognition—both as a power and a non-power—together with knowledgeable teachers.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་སེང་གེའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time King Lion Intelligence was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སེང་གེའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the king Lion Intelligence.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དབང་པོའི་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་མངོན་པར་འདོད་ན། ཤེས་པ་དང་ལྡན་པ་ལ་མཆོད་པ་བྱ་ཞིང་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་ལ་ཡང་རྣམ་པར་འཇུག་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, when bodhisattva great beings wish to understand the power and non-power of the faculties, they should worship those who are knowledgeable and so pursue knowledge of the powers and non-powers.

source: མཽད་གལ་གྱི་བུ་ངས་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པར་བྱ་བའི་དོན་དུ། །སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་སྟོབས་ཤེས་པ་ཇི་ལྟར་ཤེས་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་ཡིད་བཞིན་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the powers and non-powers. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and thus gain knowledge of the powers of sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་བྲམ་ཟེ་དབང་པོའི་ལྷ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ།
en: “Maudgalyāyana, in the distant past, beyond unfathomable timespans of cyclic existence, there was a brahmin known as God of Faculties, who was like a great sal tree.

source: ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ།
en: He was wealthy and in possession of abundant enjoyments.

source: མང་དུ་ཐོས་པ་རྣམས་ཡོངས་སུ་སྡུད་པ་ཤེས་པ་ལ་གུས་པ་ཞིག་བྱུང་སྟེ
en: He gathered the learned around him and had respect for knowledge.

source: དེ་དགེ་སྦྱོང་དང་བྲམ་ཟེ་འདོན་པ་ལ་ལྷག་པར་མོས་པ་རྣམས་ཡོངས་སུ་སྡུད་པ།
en: He gathered those mendicants and brahmins who sincerely practiced recitation.

source: བྱེ་བྲག་ཤེས་ཤིང་བློའི་སྟོབས་ཀྱི་བྱེ་བྲག་ཤེས་པ། བརྩོན་འགྲུས་ཀྱི་རིམ་པའི་བྱེ་བྲག་ཤེས་པ། ཤེས་པ་ལ་ལྷག་པར་མོས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་བར་དུ་སྤྲོ་བར་བྱེད་པ།
en: He would encourage all of them to pursue knowledge of discernment, knowledge of diverse mental powers , and knowledge of different stages of diligence.

source: ཇི་ལྟར་ཤེས་པ་དག་ཆུད་ཟ་བར་མི་འགྱུར་སྙམ་ནས་མངོན་པར་བརྩོན་པ་རྣམས་ལ་རབ་ཏུ་སྤྲོ་བར་བྱེད་དོ། །
en: Concerned that no knowledge should go to waste, he sought to encourage the diligent.

source: དེས་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་དག་ཤེས་པ་སྣ་ཚོགས་མང་པོ་དག་ལ་རབ་ཏུ་བཙུད་དོ། །
en: In this way he guided many thousands of beings toward diverse and abundant knowledge.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་དབང་པོའི་ལྷ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the brahmin God of Faculties, who was like a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། བྲམ་ཟེ་དབང་པོའི་ལྷ་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །ངས་སྲོག་ཆགས་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དེ་དག་ཤེས་པ་སྣ་ཚོགས་ལ་རབ་ཏུ་བཙུད་དོ། །
en: In those days I was the brahmin God of Faculties, who was like a great sal tree, and in this way I guided innumerably many thousands of beings toward diverse knowledge.

source: དེའི་ཚེ་ང་ཤེས་པ་དང་ལྡན་ཞིང་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་རྣམ་པར་ཤེས་ལ།
en: At the time I was full of knowledge and comprehended the knowledge of the powers and non-powers.

source: ད་ལྟར་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་མངོན་པར་རྫོགས་པར་ཐུགས་སུ་ཆུད་དོ། །
en: Now, having awoken to unsurpassed and perfect buddhahood, I also remain fully aware of the powers and non-powers of sentient beings.

source: དེར་ཡང་ང་ལྟ་བུ་མེད་པས་གང་གིས་ང་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་བསྒྲག་གོ། །
en: Even when no one like me is present, the lion’s roar will be expressed within my retinue.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཕ་རོལ་གྱི་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་ལ་མངོན་པར་བརྩོན་པར་བྱའོ། །
en: Thus, Maudgalyāyana, bodhisattvas must endeavor in knowledge of the powers and non-powers of others.

source: བདག་ཉིད་ཀྱང་བསྟན་བཅོས་འདོན་པ་ཐམས་ཅད་ལ་ལྷག་པར་མོས་པར་བྱའོ། །
en: They must also venerate all those who recite the treatises.

source: མཽད་གལ་གྱི་བུ་ངས་སྟོབས་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྟོབས་བསྐྱེད་པའི་རིམ་པ་ཤེས་པ་ཇི་ལྟར་ཤེས་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand cessation as related to knowledge of the powers. I did this by wondering how to comprehend the stages in which the powers of all sentient beings arise.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་མེས་བྱིན་ཞེས་བྱ་བ་འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྒྲ་ཤེས་པ་མཁས་ཤིང་དོན་སེམས་པ་ཞིག་བྱུང་ངོ་། །
en: “Maudgalyāyana, in the distant past, beyond unfathomable timespans of cyclic existence, there was a king known as Agnidatta, who was an expert in all the languages of beings, and who understood their meanings.

source: དེ་སྒྲ་གང་དང་གང་ཐོས་པ་དེ་ཉིད་ཀྱི་དོན་རྣམ་པར་ཤེས་ཏེ། ཐོས་པ་འདི་བྱུང་ན། དེ་ཅིའི་ཕྱིར་དོན་བརྗོད། ཅིའི་ཕྱིར་དུས་ཀྱི་དོན་བརྗོད། ཡང་ཁ་ཅིག་ནི་བརྗོད། ཡང་ན་ཁ་ཅིག་ནི་མི་བརྗོད་དོ། །
en: Whichever word he heard, he would comprehend its meaning, as well as why it was spoken in the given context, and what it could and could not imply.

source: དེ་ལྟར་ཤེས་པ་ཐམས་ཅད་ལ་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་རྗེས་སུ་འགྲོ་སྟེ།
en: Thus, with respect to all knowledge, he would know what is a power and a non-power.

source: བྱ་བ་ཐམས་ཅད་ལ་ཤེས་པ་འདིའི་བྱ་བ་བྱས་ནས་ཅི་འགགས་སམ། འོན་ཏེ་མ་བྱས།
en: He would be aware of when actions cease subsequent to the functioning of knowledge, or when they cease without the functioning of knowledge.

source: འོན་ཏེ་བྱ་བ་ཅུང་ཟད་ཅིག་བྱས་ནས་འགགས་སམ། ཅུང་ཟད་ཅིག་མ་བྱས།
en: He would know how they cease with a slight action, or with no action.

source: གང་ཟག་འདི་ཇི་ཙམ་ན་ཤེས་པའི་སྣོད་དུ་འགྱུར། ཇི་ཙམ་ན་ཉོན་མོངས་པ་ཞི་བར་ནུས།
en: He would know how a person becomes a vessel of knowledge, or how a person becomes capable of pacifying the afflictions.

source: དེ་དེ་ལྟར་ཤེས་པ་དེ་ལ་ངེས་པར་བྱུང་སྟེ། འཛམ་བུ་གླིང་ཀུན་གྱི་ཤེས་པ་ཐམས་ཅད་ཀྱི་སློབ་དཔོན་དུ་གྱུར་ཏོ། །
en: Thus, having attained such understanding, he became a master of universal knowledge in the world.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མེས་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time King Agnidatta was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མེས་བྱིན་ཞེས་བྱ་བ་འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྒྲ་ཤེས་པ་བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་དོན་ཤེས་པར་གྱུར་ཏོ། །
en: In those days I was King Agnidatta, who had knowledge of all the languages of beings and who knew all the subject matters of the treatises.

source: དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་ང་སྒྲ་ཐམས་ཅད་ཤེས་པ་རྣམ་པར་ཤེས་ཤིང་བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་པ་ཤེས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Through such roots of virtue I comprehended all language and mastered all treatises, thus awakening to unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་བསྟན་བཅོས་ཐམས་ཅད་ལ་མཁས་པར་བྱ། བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་དོན་ལ་ཡང་མཁས་པར་བྱའོ། །
en: Maudgalyāyana, bodhisattvas must therefore become experts in all the treatises and master all of their subject matter.

source: མཽད་གལ་གྱི་བུ་ངས་སྟོབས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་སེམས་ཅན་རྣམས་ཀྱི་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་ལྟར་རྣམ་པར་ཤེས་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of the powers. I did this by wondering how I could comprehend the knowledge of the path that leads to cessation as related to knowledge of the powers and non-powers of sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དྲང་སྲོང་འོད་བཟང་ཞེས་བྱ་བ། བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་དང་། ཡོན་ཏན་དང་། ཤེས་པ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: “Maudgalyāyana, in the distant past there was a sage known as Suprabha, a master of disciplined conduct and austerities who was endowed with excellent qualities and knowledge.

source: དེའི་བརྟུལ་ཞུགས་ནི་རལ་པའི་ཐོར་ཚུགས་ལྔ་ཐོགས་ཏེ། དེ་དག་ལ་སོགས་པ་བརྟུལ་ཞུགས་ཀྱི་བྱེ་བྲག་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། །
en: He observed innumerable forms of discipline, such as keeping his hair in a topknot of five braids.

source: དེའི་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་གྱི་ནང་དུ་གནས་པར་བརྩོན་ལ། དེ་གྲང་བ་དང་དྲོ་བ་ཡིད་ལ་བྱེད་པའི་ཉོན་མོངས་པ་ཟད་ཅིང་བསྲེག་ལུགས་ཟ་བ། ལུས་ལ་མི་ལྟོས་པ་ཡིན་ཏེ
en: Diligently practicing in his forest hermitage, he had exhausted the afflictions associated with cold and heat and he sustained himself on burned offerings without any consideration for the body.

source: དེ་དག་ལ་སོགས་པ་གཞན་ཡང་དཀའ་ཐུབ་ཀྱི་བྱེ་བྲག་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། །
en: As such, he observed these and infinitely many other aspects of an austere lifestyle.

source: དེའི་ཡོན་ཏན་གྱི་ཁྱད་པར་ནི་འདི་དག་ཡིན་ཏེ། སྲོག་ཆགས་འབྱུང་པོ་རྣམས་ལ་མི་འཚེམ་བྱིན་པ་དག་ཤིན་ཏུ་སྡོམ།
en: “Endowed with many special qualities, the sage did not bring harm on beings and he had tremendous restraint with respect to taking what has not been given.

source: གཞན་གྱི་བུད་མེད་ཀྱི་དྲུང་དུ་འགྲོ་བའི་ཡིད་ལ་བྱེད་པ་མེད། ཆང་འཐུང་བ་སྤངས།
en: He had no inclination whatsoever to associate with another’s wife, and he had given up drinking alcohol.

source: སེམས་འཁྲུལ་བ་མེད། དཀའ་ཐུབ་དང་མ་བྲལ།
en: With a mind free from confusion, he never separated from his austere practices.

source: ཕ་རོལ་གྱི་སེམས་རྗེས་སུ་སྲུང་།
en: He protected the minds of others,

source: ཚིག་རྩུབ་པོ་ཡོངས་སུ་སྲུང་།
en: refrained from harsh words,

source: ཀུན་ཤེས་པ་ལ་བསྟེན།
en: followed the rules,

source: སྔོན་གྱི་དྲང་སྲོང་གི་རྗེས་སུ་དྲན་ཏེ།
en: and recollected the sages of the past.

source: དེ་དག་ལ་སོགས་པ་གཞན་ཡང་ཡོན་ཏན་གྱི་ཁྱད་པར་དཔག་ཏུ་མེད་པ་དག་དང་ལྡན་པར་གྱུར་ཏོ། །
en: He possessed these and infinitely many other special qualities.

source: དེའི་ཤེས་པའི་ཁྱད་པར་ནི་འདི་ལྟ་བུ་འདི་དག་ཡིན་ཏེ། འདི་ལྟ་སྟེ། རྫུ་འཕྲུལ་གྱི་རྣམ་པ་ཤེས་པ་དང་། ལྷའི་རྣ་བ་ཤེས་པ་དང་།
en: “Among his special cognitive abilities were miraculous skills, as well as the divine ear;

source: ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་།
en: knowledge of the minds of others;

source: སྔོན་གྱི་གནས་ཤེས་པ་དང་།
en: knowledge of past abodes;

source: སེམས་ཅན་རྣམས་ཀྱི་འཆི་འཕོ་དང་། སྐྱེ་བ་ཤེས་པ་དང་།
en: knowledge of the death, transference, and rebirth of sentient beings;

source: བཟོའི་གནས་དང་།
en: knowledge of the arts and sciences;

source: ལས་ཀྱི་གནས་ཀྱི་དོན་ཐམས་ཅད་ཤེས་པ་དང་།
en: knowledge of administration;

source: ཆོས་ཤེས།
en: knowledge of Dharma;

source: དུས་ཤེས།
en: knowledge of time;

source: དུས་ཚོད་ཤེས།
en: knowledge of duration;

source: བདག་ཤེས།
en: knowledge of self;

source: ཐབས་ལ་མཁས་པ་ཤེས་ཏེ།
en: knowledge of means;

source: དེ་དག་ལ་སོགས་པ་གཞན་ཡང་ཤེས་པའི་ཁྱད་པར་དག་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། །
en: and innumerably many other types of special cognition.

source: བདག་གི་ཤེས་པའི་ཁྱད་པར་འདི་དག་ནི་རྟོགས་ན་ཤེས་པ་གང་གིས་ཤེས་པ་འདི་དག་ཐམས་ཅད་གང་དུ་འགོག་པར་འགྱུར་བའི་ཡོངས་སུ་ཤེས་པའི་ཤེས་པ་དེ་དག་མི་ཤེས་ཏེ།
en: ‘I have accomplished such an abundance of knowledge, yet I lack the understanding that brings all consciousness to cessation.

source: འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་གང་དག་ཤེས་པ་འདི་ལ་བསླབས་པ་སུ་ཡོད་སྙམ་ནས།
en: Where in this world might I find a mendicant or brahmin who is trained in that?’

source: དེ་ཤེས་པ་དེ་བཙལ་བའི་ཕྱིར་སློངས་མོས་འཚོ་བར་གྱུར་ནས།
en: Thus, in pursuit of that knowledge, he became a wandering beggar.

source: དེ་མུ་སྟེགས་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་སོང་བ་དང་། དེ་སློངས་མོས་འཚོ་བར་རིག་ནས་གདོལ་པ་ཡན་ཅད་དག་གིས་མཆོད་སྦྱིན་བྱེད་ཀྱང་གང་གིས་ཡང་མ་བླངས་སོ། །
en: Whenever he came across extremists he would not take any offerings from any of them, outcastes included, once they had understood who he was.

source: དེ་མ་བླངས་པས་སློངས་མོས་འཚོ་བའི་སྒྲ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དུ་གྲགས་སོ། །
en: Thus his way of maintaining a beggar’s livelihood without taking any alms became well known throughout the world’s ten directions.

source: དེའི་ཚེ་ལྷོ་ཕྱོགས་ན་གངས་རིའི་རྒྱལ་པོ་ལ་དྲང་སྲོང་ཀུན་རིག་ཅེས་བྱ་བ་ལྔ་མངོན་པར་ཤེས་པ་ཞིག་གནས་སོ། །
en: “At that time there was in the southern snowy mountains a sage known as Sarvavit, who had attained the five superknowledges.

source: དེ་ཉིན་མཚན་དུ་གནས་ན་འདུག་སྟེ། འཇིག་རྟེན་ཐམས་ཅད་ལ་རྟོག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Throughout day and night he remained in his retreat, dwelling in the absorption known as thinking of the entire world .

source: ཇི་ལྟར་སེམས་མཉམ་པར་གཞག་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དག་རབ་ཏུ་ཤེས། ངག་གི་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས། ལུས་ཀྱི་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས།
en: From within that absorption he was able to know what went on in the minds of all beings, what they were saying, and what they were engaged in physically.

source: དཀའ་ཐུབ་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས། བརྟུལ་ཞུགས་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས། ཡོན་ཏན་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས། ཤེས་པ་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས། རྣམ་པར་ཤེས་པ་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: He also knew of their austerities, their disciplined conduct, their qualities, their knowledge, and their consciousness.

source: དེ་ལྷའི་མིག་གིས་སློངས་མོས་འཚོ་བ་འོད་བཟང་དེ་མཐོང་སྟེ། དེའི་སེམས་ཀྱང་རབ་ཏུ་ཤེས། དེའི་བསམ་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: “Thus, as the sage Sarvavit perceived the beggar Suprabha by means of his divine eye, he was aware of the latter’s thoughts and wishes.

source: སློངས་མོས་འཚོ་བ་འོད་བཟང་འདི་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པའི་ངེས་པར་འབྱུང་བ་རབ་ཏུ་མི་ཤེས་ཏེ། རབ་ཏུ་མི་ཤེས་པས་ཉམ་ཐག་གོ་སྙམ་ནས། དེ་དེ་ལ་སྙིང་རྗེ་སྐྱེས་སོ། །
en: Feeling compassion, he recognized, ‘The beggar Suprabha suffers due to his ignorance, lacking the understanding of the means for knowing the powers and non-powers.’

source: དེ་སྙིང་རྗེས་ནོན་པའི་སེམས་ཀྱིས་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུའི་ལག་པ་བསྐུམ་པ་ལས་བརྐྱང་བའམ། ལག་པ་བརྐྱང་བ་ལས་བསྐུམ་པ་དེ་བཞིན་དུ་དྲང་སྲོང་ཀུན་རིག་གངས་རིའི་རྒྱལ་པོ་ལས་བབས་ནས། སློངས་མོས་འཚོ་བ་འོད་བཟང་གི་མདུན་དུ་ཤེས་པ་དང་ལྡན་པར་བྱས་ནས་འདུག་གོ། །
en: Thus, as quickly as a man can stretch or bend his arm, the sage Sarvavit, compelled by compassion, descended from the snow mountain and appeared intentionally before the beggar Suprabha.

source: སློངས་མོས་འཚོ་བ་འོད་བཟང་གིས་ཤེས་རིག་དེ་རྒྱང་རིང་པོ་ནས་འོང་བ་མཐོང་ངོ་། །
en: The latter saw Sarvavit coming from afar

source: མཐོང་ནས་ཀྱང་དེའི་ནུས་པ་སྤངས་ནས། ཀུན་རིག་ཤེས་ལྡན་གྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: and, ignoring his own powers, he bowed his head to Sarvavit’s feet and arranged a seat for him.

source: ཤེས་རིག་གི་སྟན་བཤམས་ནས་ལག་པ་གཉིས་ཀྱིས་ལེགས་པར་བཟུང་ནས་ཤེས་པ་སྨྲ་བར་སྟན་དེ་ལ་བཞག་གོ། །
en: Taking hold of Sarvavit with both hands, he led the teacher to his seat.

source: བཞག་ནས་ཤེས་པར་འདོད་པ་དང་ལྡན་པས་ཞེས་ཆེར་རབ་ཏུ་བྱས་ཏེ། དྲང་སྲོང་ཀུན་རིག་དེ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་དྲི་བ་དྲིས་པ།
en: With great yearning for knowledge, Suprabha then presented his questions to the sage Sarvavit in the following verses:

source: མཁྱེན་པ་ཀུན་ལ་འཇིགས་མི་མངའ། །
en: “ ‘Among the learned you have no fear

source: མཁྱེན་པ་གསུང་པས་གང་ལ། །
en: And thus you express your knowledge.

source: གང་དུ་བདག་སྐྱེས་ཐེ་ཚོམ་མཆིས། །
en: I have doubts as to where and how I was born.

source: དགེ་བའི་སུག་ལས་ཅི་བགྱིས་པས། །སེམས་ཅན་ཀུན་ལ་ཕན་པ་བགྱིད། །
en: Whatever virtue is done “ ‘Will be of benefit to sentient beings.

source: སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་དང་། །སྟོབས་དང་སྟོབས་མ་ཡིན་ཤེས་དང་། །གང་གིས་ཁྱོད་ཀྱིས་ཤེས་མཆོག་ནི། །ཐོས་ནས་དེ་ནས་ཕྱིར་མི་འགག །
en: Knowledge of the activities of all beings, And of the powers and non-powers, And of your supreme cognition— “ ‘Once heard of, it becomes unceasing.

source: ཤེས་པ་གང་གིས་རྣམ་ཤེས་པ། །ཡེ་ཤེས་ཆེན་པོ་ཁྱོད་ལ་ཞུ། །
en: Such knowledge that turns consciousness into great wisdom I request from you.

source: མཁས་པ་དེ་དག་བདག་ལ་གསུངས། །
en: The wise have taught me

source: ཤེས་པ་ཡི་ནི་སྟོབས་དང་ལྡན། །ཤེས་པ་ཀུན་ལ་འཇིགས་མེད་པ། །སྙིང་བརྩེ་བ་ན་དེ་དག་ཀུན། །
en: “ ‘With the power of knowledge, A knowledge that is fearless And of loving heart.

source: ཇི་ལྟ་བཞིན་དུ་དེའི་ལུང་བསྟན། །ཆོས་སྦྱིན་པ་ལ་སེར་སྣ་མེད། །
en: Thus they have instructed me correctly “ ‘And without any miserliness in giving the gift of Dharma.

source: ཤེས་པ་དག་ཀྱང་ཡོངས་སུ་སྡུད། །
en: Thus I gather knowledge

source: ཤེས་ལྡན་རྣམས་ལ་དེ་དགའ་ཞིང་། །སྦྱིན་པ་ཡང་དག་སྡུད་པར་བྱེད། །
en: While pleasing the knowledgeable and gathering gifts.

source: ཤེས་པ་མང་པོ་རྣམས་ཀྱང་འདོད། །
en: I yearn for abundant knowledge

source: སྦྱིན་པ་ཡང་དག་སྡུད་པར་བྱེད། །
en: “ ‘And bring together gifts.

source: ཤེས་པའི་ཡེ་ཤེས་ཚོལ་བྱེད་པ། །ཡེ་ཤེས་དམ་པ་དེ་འཐོབ་བོ། །
en: Searching for the wisdom of knowledge I shall attain true wisdom.

source: མཁས་པ་ཡི་ནི་ཤེས་པ་ཡིས། །མཛངས་པ་དེ་ནི་ཤེས་པ་རྟོགས། །
en: “ ‘With the mind of the wise The learned shall gain insight.

source: འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་ཤིང་། །མྱུར་བ་ཉིད་དུ་ཏིང་འཛིན་སྐྱེས། །
en: With the knowledge of the path to cessation Absorption will quickly spring forth.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། སློངས་མོས་འཚོ་བ་འོད་བཟང་ཞེས་བྱ་བར་གྱུར་པ་དེ་བཞིན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the beggar Suprabha was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་སློངས་མོས་འཚོ་བ་འོད་བཟང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the beggar Suprabha.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་ཀུན་རིག་ཅེས་བྱ་བ་ཤེས་པ་སྨྲ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Maudgalyāyana, in case you may think that at that time the conveyor of knowledge, the sage Sarvavit, was anyone else, do not think so.

source: དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་དེ་དེའི་ཚེ་ཀུན་རིག་ཅེས་བྱ་བ་ཤེས་པ་སྨྲ་བར་གྱུར་ཏོ། །
en: In those days the thus-gone Dīpaṃkara was the conveyor of knowledge, the sage Sarvavit.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོབས་དང་སྟོབས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་རྟོགས་པར་འདོད་པས་ཡང་དག་པར་སྡོམ་པ་ཅན་དུ་བྱ།
en: Therefore, Maudgalyāyana, bodhisattva great beings who wish to understand the knowledge of the path that leads to cessation as related to knowledge of the powers and non-powers must receive vows,

source: ཡེ་ཤེས་ཀྱི་སྣང་བ་འདོད་པར་ཡང་བྱ།
en: yearn for the light of wisdom,

source: འཇིག་རྟེན་གྱི་ཟང་ཟིང་ཡང་ཡོངས་སུ་གཏང་བར་བྱའོ། །
en: and relinquish mundane possessions.”

source: མཽད་གལ་གྱི་བུ་ངས་བརྩོན་འགྲུས་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བརྩོན་འགྲུས་ཤེས་པ་ཇི་ལྟར་རྟོགས་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand diligence. I did this by wondering how I could realize knowledge of diligence for the sake of all sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེད་དཔོན་སློང་ལྡན་ཞེས་བྱ་བ་ཕྱུག་ཅིང་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a captain named Voyager.

source: ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། སྔོན་ནས་རབ་ཏུ་ཉོན་མོངས་པ་མེད་པ།
en: Rich and prosperous, the captain possessed numerous enjoyments, and he had for long been free from crude afflictions.

source: དེད་དཔོན་གྱི་བུ་དེད་དཔོན་གྱི་བཟོའི་རིགས་ཁོང་དུ་ཆུད་པར་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: Himself the son of a captain, he was knowledgeable in the fields of learning associated with his trade.

source: དེའི་ཕའི་བསམ་པ་བདག་ཇི་ལྟ་བུ་འདི་དང་མི་འབྲལ་བར་བྱ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། བདག་ལ་བདུན་བརྒྱུད་ཚུན་ཆད་ཀྱི་ནོར་རྫས་མང་པོ་མ་ཉམས་པར་ཡོད་དེ།
en: “The father of Voyager had thought to himself, ‘I shall by no means let my son leave me, because I still have wealth gathered over seven generations.

source: དེས་ན་གཞོན་ནུ་འདི་འཚོ་བ་བདེ་བར་འགྱུར་རོ་སྙམ་མོ། །
en: My boy can have a happy life as things are.’

source: དེ་སྐྱེས་མ་ཐག་ཏུ་ཚོང་པ་གང་དག་གི་ཁྱེའུ་ཤེད་མཉམ་དུ་སྐྱེས་པ་དེ་དག་ཕ་མས་དེའི་སྟེན་གྲོགས་སུ་བྱིན་ཏེ།
en: Hence, as soon as Voyager was born, his parents let him keep company with other merchant children of similar age.

source: བུ་སྟེན་གྲོགས་འདི་དག་དང་དེ་ལྟར་ལྷན་ཅིག་ཏུ་དགའ་བར་རྩེས་ཤིག །ཡོངས་སུ་སྤྱོད་ཅིག །
en: ‘Play with these good friends and keep their company,’ they would instruct him.

source: དེ་ཁྱིམ་བདག་དེ་ཉིད་ཀྱི་ནང་ན་བཟོ་ཐམས་ཅད་སློབ་ཏུ་བཅུག་སྟེ། དེར་ཡི་གེ་དང་། དེར་བགྲང་བ་དང་། དེར་གྲངས་དང་། དེར་ཚོང་པའི་ཐ་སྙད་དང་། དེར་ཞིང་རྨེད་པའི་ཐ་སྙད་དང་། དེར་བཟོའི་ཐ་སྙད་དང་། དེར་བཟོ་ཐབས་ཐམས་ཅད་དང་། ཐ་ན་ལས་བྱེད་པའི་བཟོ་ཡང་སློབ་ཏུ་བཅུག་སྟེ
en: “His father would also arrange for his son’s tuition within his own house, and thus the boy learned all the crafts: the alphabet, numbers, mathematics, business, agriculture, crafts, technology, and even the ways of ordinary labor.

source: དེ་བཟོ་ཐམས་ཅད་ལ་བསླབས་ཤིང་། སྒྱུ་རྩལ་གྱི་རྣམ་པ་ཐམས་ཅད་ཤེས་ཏེ། སྒྱུ་རྩལ་དྲུག་ཅུ་རྩ་བཞི་བསླབས་སོ། །
en: Thus he studied all the crafts and gained universal understanding, having learned all of the sixty-four skills.
